In [29]:
import pandas as pd

excel_path = '/Users/6410613/Desktop/sample.xlsx'
df = pd.read_excel(excel_path)
df

    PLAYER  GAME_1  GAME_2  GAME_3
0  Garrett       2       3       1
1    Jerry       4       5       1
2      Amy       4       0       1
3    Carol       4       0       1
4     Dina       1       2       1
5   Sandra       5       3       2

In [30]:
df['TOTAL_PTS'] = df.sum(axis=1)
df

    PLAYER  GAME_1  GAME_2  GAME_3  TOTAL_PTS
0  Garrett       2       3       1          6
1    Jerry       4       5       1         10
2      Amy       4       0       1          5
3    Carol       4       0       1          5
4     Dina       1       2       1          4
5   Sandra       5       3       2         10

In [31]:
team_1 = {
  "total_pts": 0,
  "count": 0,
  "players": []
}

team_2 = {
  "total_pts": 0,
  "count": 0,
  "players": []
}

In [32]:
def check_team(row):
    team = ''
    if (team_1['total_pts'] + row['TOTAL_PTS'] <= 20):
        team_1['total_pts'] = team_1['total_pts'] +  row['TOTAL_PTS']
        team_1['count'] = team_1['count'] + 1
        team_1['players'].append(row['PLAYER'])
        team = 'team_1'
    elif (team_2['total_pts'] + row['TOTAL_PTS'] <= 20):
        team_2['total_pts'] = team_2['total_pts'] +  row['TOTAL_PTS']
        team_2['count'] = team_2['count'] + 1
        team_2['players'].append(row['PLAYER'])
        team = 'team_2'
    return team

In [33]:
df['TEAM_NAME'] = df.apply(check_team, axis=1)

In [34]:
df

    PLAYER  GAME_1  GAME_2  GAME_3  TOTAL_PTS TEAM_NAME
0  Garrett       2       3       1          6    team_1
1    Jerry       4       5       1         10    team_1
2      Amy       4       0       1          5    team_2
3    Carol       4       0       1          5    team_2
4     Dina       1       2       1          4    team_1
5   Sandra       5       3       2         10    team_2

In [35]:
print(team_1)

{'total_pts': 20, 'count': 3, 'players': ['Garrett', 'Jerry', 'Dina']}

In [36]:
print(team_2)

{'total_pts': 20, 'count': 3, 'players': ['Amy', 'Carol', 'Sandra']}